$(document).ready(function () {
	$('.header-burger').click(function (event) {
		$('.header-burger,.header-burger__menu').toggleClass('active');
		$('body').toggleClass('lock');
	});
});
// ==========================================
// <ВЫДЕЛЕНИЕ АКТИВНОГО МЕНЮ>
// ==========================================
$('a').click(function () {
    $('.menu-active').removeClass('menu-active');
    $(this).addClass('menu-active');
});
// ==========================================
// ==========================================
// </ВЫДЕЛЕНИЕ АКТИВНОГО МЕНЮ>
// ==========================================

// ==========================================
// <2 СКРИПТА НА ИЗОБРАЖЕНИЯ, ЕСЛИ НЕ ОТОБРАЖАЕТСЯ, АКТИВНЫЙ СКРИПТ ЗАКОМЕНТИРОВАТЬ, А ЗАКОМЕНТИРОВАННЫЙ РАССКОМЕНТИРОВАТЬ>
// ==========================================
function ibg() {
    $.each($('.ibg'), function (index, val) {
        if ($(this).find('img').length > 0) {
            $(this).css('background-image', 'url("' + $(this).find('img').attr('src') + '")');
        }
    });
}
ibg();
// ==========================================
// </2 СКРИПТА НА ИЗОБРАЖЕНИЯ>
// ==========================================

// ==========================================
// <ПОДКЛЮЧЕНИЕ ТАБОВ ПОРТФОЛИО>
// ==========================================
var portfolio = document.querySelector('.portfolio-content');
var mixer = mixitup(portfolio);
// ==========================================
// </ПОДКЛЮЧЕНИЕ ТАБОВ ПОРТФОЛИО>
// ==========================================